---
kind: method
id: M:Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceXY
source: html/d32ec824-4333-7f68-2b38-83cd1aacb732.htm
---
# Autodesk.Revit.DB.ReferencePoint.GetCoordinatePlaneReferenceXY Method

A reference for the XY plane of the coordinate
system.

## Syntax (C#)
```csharp
public Reference GetCoordinatePlaneReferenceXY()
```